In [1]:
import numpy as np
import pandas as pd

In [3]:
ser1 = pd.Series(np.arange(3),index=["A","B","C"])



"""
Podemos realizar a seguinte operação com as series: 

2*Serie

ISso retorna os valores originais *2. 
"""
ser1 = 2*ser1
ser1

A    0
B    2
C    4
dtype: int64

In [6]:
"""
Podemos selecionar as entradas daas seguintes maneiras:

1 - Pelo index
2 - Pelo valor, como uma lista. 
3 - por range numerico, como uma lista.
3 - Por range do nome do Index.
4 - Por lógica, Equações e etc.
"""
ser1[0]

0

In [7]:
ser1["B"]

2

In [10]:
ser1[0:2]

A    0
B    2
dtype: int64

In [11]:
#Range de nomes
ser1[["A","B"]]

A    0
B    2
dtype: int64

In [12]:
#Logica matematica
ser1[ser1 > 3]

C    4
dtype: int64

In [14]:
#Podemos mudar os valores de acordo com a logica
ser1[ser1 > 3] = 10
ser1

A     0
B     2
C    10
dtype: int64

In [18]:
df = pd.DataFrame(np.arange(25).reshape((5,5)),index=["SP","RJ","DF","ES","PE"],
                 columns=["A",'B','C','D','E'])
df

     A   B   C   D   E
SP   0   1   2   3   4
RJ   5   6   7   8   9
DF  10  11  12  13  14
ES  15  16  17  18  19
PE  20  21  22  23  24

In [19]:
"""
Como Selecionar dados de um DataFrame?

Similar como fazemos em Series.
"""

df['B']

SP     1
RJ     6
DF    11
ES    16
PE    21
Name: B, dtype: int64

In [21]:
df[["A",'B']]

     A   B
SP   0   1
RJ   5   6
DF  10  11
ES  15  16
PE  20  21

In [22]:
df[df['C'] > 8]

     A   B   C   D   E
DF  10  11  12  13  14
ES  15  16  17  18  19
PE  20  21  22  23  24

In [24]:
"""
Fazer essa operacao booleana retorna um DF com 
True onde a condição foi satisfeita e False onde nao foi.
"""
df > 10

        A      B      C      D      E
SP  False  False  False  False  False
RJ  False  False  False  False  False
DF  False   True   True   True   True
ES   True   True   True   True   True
PE   True   True   True   True   True